# -----------------------------------------------------------
# Formula
# -----------------------------------------------------------
brew 'bats-core'
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'sheldon'
brew 'starship'
brew 'gh'
brew 'zsh'
brew 'uv'
brew 'yarn'
brew 'git'
brew 'mise'
brew 'tmux'
brew 'jq'
tap 'schpet/tap'
brew 'schpet/tap/linear'
tap 'manaflow-ai/cmux'

# -----------------------------------------------------------
# Cask
# -----------------------------------------------------------
cask 'google-chrome'
cask 'wezterm'
cask 'cmux'
cask 'cursor'
cask 'docker-desktop'
cask 'slack'
cask 'obsidian'
cask 'zoom'
cask 'notion'
# cask '1password'
cask 'claude'
cask 'claude-code@latest'
cask 'flux-app'
cask 'wireshark-app'
cask 'karabiner-elements'
# Voice input: Handy (local STT) + ollama (offline LLM post-processing server),
# and Typeless (GUI/cloud alternative). Switch between them via `voice-switch`.
# Cloud post-processing (opt-in via `voice-switch cloud`) targets Cerebras, which
# does not retain or train on request data:
#   https://support.cerebras.net/articles/1811589793-does-cerebras-retain-my-data
#   https://www.cerebras.ai/terms-of-service
cask 'handy'
cask 'ollama-app'
cask 'typeless'
