# -----------------------------------------------------------
# Formula
# -----------------------------------------------------------
brew 'coreutils'
brew 'fd'
brew 'fzf'
brew 'sheldon'
brew 'starship'
brew 'gh'
brew 'zsh'
brew 'uv'
brew 'yarn'
brew 'git'
brew 'mise'
brew 'tmux'

# -----------------------------------------------------------
# Cask
# -----------------------------------------------------------
cask 'google-chrome'
cask 'wezterm'
cask 'cursor'
cask 'docker-desktop'
cask 'visual-studio-code'
cask 'slack'
cask 'zoom'
cask 'notion'
cask '1password'
cask 'claude'
cask 'claude-code'
cask 'flux-app'
cask 'wireshark-app'
